tomaskovacik/MegaCore/avr/boards.txt
#########################################
## This file is created by MCUdude 
## for use with MegaCore
## https://github.com/MCUdude/MegaCore	
##
## This is the file where fuse settings,
## clock frequencies and compiler flags
## are located.
##
## Run ./makeall to build all bootloaders
#########################################

# Menu options
menu.clock=Clock
menu.BOD=BOD
menu.LTO=Compiler LTO
menu.pinout=Pinout



#####################
#### ATmega2561  ####
#####################

2561.name=ATmega2561
2561.upload.tool=avrdude
2561.upload.protocol=arduino
2561.upload.maximum_size=261120
2561.upload.maximum_data_size=8192

2561.bootloader.tool=avrdude
2561.bootloader.unlock_bits=0x3f
2561.bootloader.lock_bits=0x0f

2561.build.variant=standard
2561.build.core=MegaCore
2561.build.mcu=atmega2561
2561.build.board=AVR_ATmega2561

# Brown out detection
2561.menu.BOD.2v7=2.7v
2561.menu.BOD.2v7.bootloader.extended_fuses=0xfd
2561.menu.BOD.4v3=4.3v
2561.menu.BOD.4v3.bootloader.extended_fuses=0xfc
2561.menu.BOD.1v8=1.8v
2561.menu.BOD.1v8.bootloader.extended_fuses=0xfe
2561.menu.BOD.disabled=Disabled
2561.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
2561.menu.LTO.Os=Disabled (default)
2561.menu.LTO.Os.compiler.c.extra_flags=
2561.menu.LTO.Os.compiler.c.elf.extra_flags=
2561.menu.LTO.Os.compiler.cpp.extra_flags=
2561.menu.LTO.Os.ltoarcmd=avr-ar

2561.menu.LTO.Os_flto=Enabled
2561.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
2561.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
2561.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
2561.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
2561.menu.clock.16MHz_external=16 MHz external
2561.menu.clock.16MHz_external.upload.speed=115200
2561.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.16MHz_external.bootloader.high_fuses=0xd6
2561.menu.clock.16MHz_external.bootloader.file=optiboot_flash_256kb/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
2561.menu.clock.16MHz_external.build.f_cpu=16000000L

2561.menu.clock.20MHz_external=20 MHz external
2561.menu.clock.20MHz_external.upload.speed=115200
2561.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.20MHz_external.bootloader.high_fuses=0xd6
2561.menu.clock.20MHz_external.bootloader.file=optiboot_flash_256kb/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
2561.menu.clock.20MHz_external.build.f_cpu=20000000L

2561.menu.clock.18_432MHz_external=18.432 MHz external
2561.menu.clock.18_432MHz_external.upload.speed=115200
2561.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.18_432MHz_external.bootloader.high_fuses=0xd6
2561.menu.clock.18_432MHz_external.bootloader.file=optiboot_flash_256kb/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
2561.menu.clock.18_432MHz_external.build.f_cpu=18432000L

2561.menu.clock.12MHz_external=12 MHz external
2561.menu.clock.12MHz_external.upload.speed=57600
2561.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.12MHz_external.bootloader.high_fuses=0xd6
2561.menu.clock.12MHz_external.bootloader.file=optiboot_flash_256kb/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
2561.menu.clock.12MHz_external.build.f_cpu=12000000L

2561.menu.clock.8MHz_external=8 MHz external
2561.menu.clock.8MHz_external.upload.speed=38400
2561.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.8MHz_external.bootloader.high_fuses=0xd6
2561.menu.clock.8MHz_external.bootloader.file=optiboot_flash_256kb/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
2561.menu.clock.8MHz_external.build.f_cpu=8000000L

2561.menu.clock.8MHz_internal=8 MHz internal
2561.menu.clock.8MHz_internal.upload.speed=38400
2561.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
2561.menu.clock.8MHz_internal.bootloader.high_fuses=0xd6
2561.menu.clock.8MHz_internal.bootloader.file=optiboot_flash_256kb/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
2561.menu.clock.8MHz_internal.build.f_cpu=8000000L

2561.menu.clock.1MHz_internal=1 MHz internal
2561.menu.clock.1MHz_internal.upload.speed=9600
2561.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
2561.menu.clock.1MHz_internal.bootloader.high_fuses=0xd6
2561.menu.clock.1MHz_internal.bootloader.file=optiboot_flash_256kb/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
2561.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
#### ATmega2560  ####
#####################

2560.name=ATmega2560
2560.upload.tool=avrdude
2560.upload.protocol=arduino
2560.upload.maximum_size=261120
2560.upload.maximum_data_size=8192

2560.bootloader.tool=avrdude
2560.bootloader.unlock_bits=0x3f
2560.bootloader.lock_bits=0x0f

2560.build.core=MegaCore
2560.build.mcu=atmega2560
2560.build.board=AVR_ATmega2560

# Pinouts
2560.menu.pinout.mega_pinout=Arduino MEGA pinout
2560.menu.pinout.mega_pinout.build.variant=mega_pinout
2560.menu.pinout.avr_pinout=AVR pinout
2560.menu.pinout.avr_pinout.build.variant=mega_avr_pinout

# Brown out detection
2560.menu.BOD.2v7=2.7v
2560.menu.BOD.2v7.bootloader.extended_fuses=0xfd
2560.menu.BOD.4v3=4.3v
2560.menu.BOD.4v3.bootloader.extended_fuses=0xfc
2560.menu.BOD.1v8=1.8v
2560.menu.BOD.1v8.bootloader.extended_fuses=0xfe
2560.menu.BOD.disabled=Disabled
2560.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
2560.menu.LTO.Os=Disabled (default)
2560.menu.LTO.Os.compiler.c.extra_flags=
2560.menu.LTO.Os.compiler.c.elf.extra_flags=
2560.menu.LTO.Os.compiler.cpp.extra_flags=
2560.menu.LTO.Os.ltoarcmd=avr-ar

2560.menu.LTO.Os_flto=Enabled
2560.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
2560.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
2560.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
2560.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
2560.menu.clock.16MHz_external=16 MHz external
2560.menu.clock.16MHz_external.upload.speed=115200
2560.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.16MHz_external.bootloader.high_fuses=0xd6
2560.menu.clock.16MHz_external.bootloader.file=optiboot_flash_256kb/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
2560.menu.clock.16MHz_external.build.f_cpu=16000000L

2560.menu.clock.20MHz_external=20 MHz external
2560.menu.clock.20MHz_external.upload.speed=115200
2560.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.20MHz_external.bootloader.high_fuses=0xd6
2560.menu.clock.20MHz_external.bootloader.file=optiboot_flash_256kb/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
2560.menu.clock.20MHz_external.build.f_cpu=20000000L

2560.menu.clock.18_432MHz_external=18.432 MHz external
2560.menu.clock.18_432MHz_external.upload.speed=115200
2560.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.18_432MHz_external.bootloader.high_fuses=0xd6
2560.menu.clock.18_432MHz_external.bootloader.file=optiboot_flash_256kb/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
2560.menu.clock.18_432MHz_external.build.f_cpu=18432000L

2560.menu.clock.12MHz_external=12 MHz external
2560.menu.clock.12MHz_external.upload.speed=57600
2560.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.12MHz_external.bootloader.high_fuses=0xd6
2560.menu.clock.12MHz_external.bootloader.file=optiboot_flash_256kb/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
2560.menu.clock.12MHz_external.build.f_cpu=12000000L

2560.menu.clock.8MHz_external=8 MHz external
2560.menu.clock.8MHz_external.upload.speed=38400
2560.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.8MHz_external.bootloader.high_fuses=0xd6
2560.menu.clock.8MHz_external.bootloader.file=optiboot_flash_256kb/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
2560.menu.clock.8MHz_external.build.f_cpu=8000000L

