tomaskovacik/MegaCore/avr/boards.txt
2560.menu.clock.8MHz_internal=8 MHz internal
2560.menu.clock.8MHz_internal.upload.speed=38400
2560.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
2560.menu.clock.8MHz_internal.bootloader.high_fuses=0xd6
2560.menu.clock.8MHz_internal.bootloader.file=optiboot_flash_256kb/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
2560.menu.clock.8MHz_internal.build.f_cpu=8000000L

2560.menu.clock.1MHz_internal=1 MHz internal
2560.menu.clock.1MHz_internal.upload.speed=9600
2560.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
2560.menu.clock.1MHz_internal.bootloader.high_fuses=0xd6
2560.menu.clock.1MHz_internal.bootloader.file=optiboot_flash_256kb/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
2560.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
#### ATmega1281  ####
#####################

1281.name=ATmega1281
1281.upload.tool=avrdude
1281.upload.protocol=arduino
1281.upload.maximum_size=130048
1281.upload.maximum_data_size=8192

1281.bootloader.tool=avrdude
1281.bootloader.unlock_bits=0x3f
1281.bootloader.lock_bits=0x0f

1281.build.variant=standard
1281.build.core=MegaCore
1281.build.mcu=atmega1281
1281.build.board=AVR_ATmega1281

# Brown out detection
1281.menu.BOD.2v7=2.7v
1281.menu.BOD.2v7.bootloader.extended_fuses=0xfd
1281.menu.BOD.4v3=4.3v
1281.menu.BOD.4v3.bootloader.extended_fuses=0xfc
1281.menu.BOD.1v8=1.8v
1281.menu.BOD.1v8.bootloader.extended_fuses=0xfe
1281.menu.BOD.disabled=Disabled
1281.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
1281.menu.LTO.Os=Disabled (default)
1281.menu.LTO.Os.compiler.c.extra_flags=
1281.menu.LTO.Os.compiler.c.elf.extra_flags=
1281.menu.LTO.Os.compiler.cpp.extra_flags=
1281.menu.LTO.Os.ltoarcmd=avr-ar

1281.menu.LTO.Os_flto=Enabled
1281.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
1281.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
1281.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
1281.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
1281.menu.clock.16MHz_external=16 MHz external
1281.menu.clock.16MHz_external.upload.speed=115200
1281.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
1281.menu.clock.16MHz_external.bootloader.high_fuses=0xd6
1281.menu.clock.16MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
1281.menu.clock.16MHz_external.build.f_cpu=16000000L

1281.menu.clock.20MHz_external=20 MHz external
1281.menu.clock.20MHz_external.upload.speed=115200
1281.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
1281.menu.clock.20MHz_external.bootloader.high_fuses=0xd6
1281.menu.clock.20MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
1281.menu.clock.20MHz_external.build.f_cpu=20000000L

1281.menu.clock.18_432MHz_external=18.432 MHz external
1281.menu.clock.18_432MHz_external.upload.speed=115200
1281.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
1281.menu.clock.18_432MHz_external.bootloader.high_fuses=0xd6
1281.menu.clock.18_432MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
1281.menu.clock.18_432MHz_external.build.f_cpu=18432000L

1281.menu.clock.12MHz_external=12 MHz external
1281.menu.clock.12MHz_external.upload.speed=57600
1281.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
1281.menu.clock.12MHz_external.bootloader.high_fuses=0xd6
1281.menu.clock.12MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
1281.menu.clock.12MHz_external.build.f_cpu=12000000L

1281.menu.clock.8MHz_external=8 MHz external
1281.menu.clock.8MHz_external.upload.speed=38400
1281.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
1281.menu.clock.8MHz_external.bootloader.high_fuses=0xd6
1281.menu.clock.8MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
1281.menu.clock.8MHz_external.build.f_cpu=8000000L

1281.menu.clock.8MHz_internal=8 MHz internal
1281.menu.clock.8MHz_internal.upload.speed=38400
1281.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
1281.menu.clock.8MHz_internal.bootloader.high_fuses=0xd6
1281.menu.clock.8MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
1281.menu.clock.8MHz_internal.build.f_cpu=8000000L

1281.menu.clock.1MHz_internal=1 MHz internal
1281.menu.clock.1MHz_internal.upload.speed=9600
1281.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
1281.menu.clock.1MHz_internal.bootloader.high_fuses=0xd6
1281.menu.clock.1MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
1281.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
#### ATmega1280  ####
#####################

1280.name=ATmega1280
1280.upload.tool=avrdude
1280.upload.protocol=arduino
1280.upload.maximum_size=261120
1280.upload.maximum_data_size=8192

1280.bootloader.tool=avrdude
1280.bootloader.unlock_bits=0x3f
1280.bootloader.lock_bits=0x0f

1280.build.core=MegaCore
1280.build.mcu=atmega1280
1280.build.board=AVR_ATmega1280

# Pinouts
1280.menu.pinout.mega_pinout=Arduino MEGA pinout
1280.menu.pinout.mega_pinout.build.variant=mega_pinout
1280.menu.pinout.avr_pinout=AVR pinout
1280.menu.pinout.avr_pinout.build.variant=mega_avr_pinout

# Brown out detection
1280.menu.BOD.2v7=2.7v
1280.menu.BOD.2v7.bootloader.extended_fuses=0xfd
1280.menu.BOD.4v3=4.3v
1280.menu.BOD.4v3.bootloader.extended_fuses=0xfc
1280.menu.BOD.1v8=1.8v
1280.menu.BOD.1v8.bootloader.extended_fuses=0xfe
1280.menu.BOD.disabled=Disabled
1280.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
1280.menu.LTO.Os=Disabled (default)
1280.menu.LTO.Os.compiler.c.extra_flags=
1280.menu.LTO.Os.compiler.c.elf.extra_flags=
1280.menu.LTO.Os.compiler.cpp.extra_flags=
1280.menu.LTO.Os.ltoarcmd=avr-ar

1280.menu.LTO.Os_flto=Enabled
1280.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
1280.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
1280.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
1280.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

