tomaskovacik/MegaCore/avr/boards.txt
# Clock frequencies
1280.menu.clock.16MHz_external=16 MHz external
1280.menu.clock.16MHz_external.upload.speed=115200
1280.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.16MHz_external.bootloader.high_fuses=0xd6
1280.menu.clock.16MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
1280.menu.clock.16MHz_external.build.f_cpu=16000000L

1280.menu.clock.20MHz_external=20 MHz external
1280.menu.clock.20MHz_external.upload.speed=115200
1280.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.20MHz_external.bootloader.high_fuses=0xd6
1280.menu.clock.20MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
1280.menu.clock.20MHz_external.build.f_cpu=20000000L

1280.menu.clock.18_432MHz_external=18.432 MHz external
1280.menu.clock.18_432MHz_external.upload.speed=115200
1280.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.18_432MHz_external.bootloader.high_fuses=0xd6
1280.menu.clock.18_432MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
1280.menu.clock.18_432MHz_external.build.f_cpu=18432000L

1280.menu.clock.12MHz_external=12 MHz external
1280.menu.clock.12MHz_external.upload.speed=57600
1280.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.12MHz_external.bootloader.high_fuses=0xd6
1280.menu.clock.12MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
1280.menu.clock.12MHz_external.build.f_cpu=12000000L

1280.menu.clock.8MHz_external=8 MHz external
1280.menu.clock.8MHz_external.upload.speed=38400
1280.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.8MHz_external.bootloader.high_fuses=0xd6
1280.menu.clock.8MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
1280.menu.clock.8MHz_external.build.f_cpu=8000000L

1280.menu.clock.8MHz_internal=8 MHz internal
1280.menu.clock.8MHz_internal.upload.speed=38400
1280.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
1280.menu.clock.8MHz_internal.bootloader.high_fuses=0xd6
1280.menu.clock.8MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
1280.menu.clock.8MHz_internal.build.f_cpu=8000000L

1280.menu.clock.1MHz_internal=1 MHz internal
1280.menu.clock.1MHz_internal.upload.speed=9600
1280.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
1280.menu.clock.1MHz_internal.bootloader.high_fuses=0xd6
1280.menu.clock.1MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
1280.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
#### ATmega640  ####
#####################

640.name=ATmega640
640.upload.tool=avrdude
640.upload.protocol=arduino
640.upload.maximum_size=261120
640.upload.maximum_data_size=8192

640.bootloader.tool=avrdude
640.bootloader.unlock_bits=0x3f
640.bootloader.lock_bits=0x0f

640.build.core=MegaCore
640.build.mcu=atmega640
640.build.board=AVR_ATmega640

# Pinouts
640.menu.pinout.mega_pinout=Arduino MEGA pinout
640.menu.pinout.mega_pinout.build.variant=mega_pinout
640.menu.pinout.avr_pinout=AVR pinout
640.menu.pinout.avr_pinout.build.variant=mega_avr_pinout

# Brown out detection
640.menu.BOD.2v7=2.7v
640.menu.BOD.2v7.bootloader.extended_fuses=0xfd
640.menu.BOD.4v3=4.3v
640.menu.BOD.4v3.bootloader.extended_fuses=0xfc
640.menu.BOD.1v8=1.8v
640.menu.BOD.1v8.bootloader.extended_fuses=0xfe
640.menu.BOD.disabled=Disabled
640.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
640.menu.LTO.Os=Disabled (default)
640.menu.LTO.Os.compiler.c.extra_flags=
640.menu.LTO.Os.compiler.c.elf.extra_flags=
640.menu.LTO.Os.compiler.cpp.extra_flags=
640.menu.LTO.Os.ltoarcmd=avr-ar

640.menu.LTO.Os_flto=Enabled
640.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
640.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
640.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
640.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
640.menu.clock.16MHz_external=16 MHz external
640.menu.clock.16MHz_external.upload.speed=115200
640.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.16MHz_external.bootloader.high_fuses=0xd6
640.menu.clock.16MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
640.menu.clock.16MHz_external.build.f_cpu=16000000L

640.menu.clock.20MHz_external=20 MHz external
640.menu.clock.20MHz_external.upload.speed=115200
640.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.20MHz_external.bootloader.high_fuses=0xd6
640.menu.clock.20MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
640.menu.clock.20MHz_external.build.f_cpu=20000000L

640.menu.clock.18_432MHz_external=18.432 MHz external
640.menu.clock.18_432MHz_external.upload.speed=115200
640.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.18_432MHz_external.bootloader.high_fuses=0xd6
640.menu.clock.18_432MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
640.menu.clock.18_432MHz_external.build.f_cpu=18432000L

640.menu.clock.12MHz_external=12 MHz external
640.menu.clock.12MHz_external.upload.speed=57600
640.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.12MHz_external.bootloader.high_fuses=0xd6
640.menu.clock.12MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
640.menu.clock.12MHz_external.build.f_cpu=12000000L

640.menu.clock.8MHz_external=8 MHz external
640.menu.clock.8MHz_external.upload.speed=38400
640.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.8MHz_external.bootloader.high_fuses=0xd6
640.menu.clock.8MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
640.menu.clock.8MHz_external.build.f_cpu=8000000L

640.menu.clock.8MHz_internal=8 MHz internal
640.menu.clock.8MHz_internal.upload.speed=38400
640.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
640.menu.clock.8MHz_internal.bootloader.high_fuses=0xd6
640.menu.clock.8MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_{build.f_cpu}.hex
640.menu.clock.8MHz_internal.build.f_cpu=8000000L

